Revit 2027 API
IDuctPressureDropServer Interface
 Interface for external servers implementing duct pressure drop calculation.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IDuctPressureDropServer : IExternalServer
Public Interface IDuctPressureDropServer
	Inherits IExternalServer
public interface class IDuctPressureDropServer : IExternalServer
type IDuctPressureDropServer =
    interface
        interface IExternalServer
    end
The IDuctPressureDropServer type exposes the following members.
Methods
Name | Description
Calculate |  Calculate the duct pressure drop.
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetHtmlDescription |  The method that Revit will invoke to get an HTML formatted description of the server.
GetInformationLink |  The method that Revit will invoke to obtain a URL address which provides more information about the server.
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
Top
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server for the duct pressure drop calculation in DuctSettings.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace